#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3: Refreshing state... [id=repository-manager]
github_repository.repositorymanager_repositories_base_repository_DC292971: Refreshing state... [id=base]
github_team_membership.repositorymanager_teams_collaborators_membershipcollaborators_D63F5027: Refreshing state... [id=4009231:skorfmann]
github_team.repositorymanager_teams_collaborators_team_BCA4AB9D: Refreshing state... [id=4009231]
github_repository.repositorymanager_repositories_website_repository_40CA684E: Refreshing state... [id=website]
github_team_repository.repositorymanager_repositories_website_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_7CADE29C: Refreshing state... [id=4009231:website]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_membership.repositorymanager_members_wulfmann_membership_3212B28E will be created
  + resource "github_membership" "repositorymanager_members_wulfmann_membership_3212B28E" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "wulfmann"
    }

  # github_team.repositorymanager_teams_tools_team_75DFBC41 will be created
  + resource "github_team" "repositorymanager_teams_tools_team_75DFBC41" {
      + description = "tools to cdk.dev"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "tools"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # github_team_membership.repositorymanager_teams_collaborators_membershipcollaborators_D63F5027 will be destroyed
  - resource "github_team_membership" "repositorymanager_teams_collaborators_membershipcollaborators_D63F5027" {
      - etag     = "W/\"dd6cca35d2e1d2cf76ff330cb4694af9\"" -> null
      - id       = "4009231:skorfmann" -> null
      - role     = "maintainer" -> null
      - team_id  = "4009231" -> null
      - username = "skorfmann" -> null
    }

  # github_team_membership.repositorymanager_teams_tools_membershiptools_82EA4D39 will be created
  + resource "github_team_membership" "repositorymanager_teams_tools_membershiptools_82EA4D39" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "wulfmann"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*